app/controllers/clients_controller.rb

  def index
    respond_with Client.all
---
SELECT "clients".* FROM "clients"