app/controllers/clients_controller.rb

  def index
    if params[:id]
      respond_with Client.find(params[:id])
    else
      respond_with User.find(current_user).clients
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "clients".* FROM "clients" WHERE "clients"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1

  def create
    @client = Client.new(safe_client_params)
    if @client.save
---
INSERT INTO "clients" ("created_at", "email", "name", "notes", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 10 Dec 2013 01:29:02 UTC +00:00], ["email", "work@work.com"], ["name", "Company"], ["notes", "test"], ["updated_at", Tue, 10 Dec 2013 01:29:02 UTC +00:00], ["user_id", 1]]